In [22]:
import pandas as pd
import numpy as np

In [2]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 'author_name': ['Тургенев', 'Чехов', 'Островский'] })

In [3]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [4]:
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3], 'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 
'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price': [450, 300, 350, 500, 450, 370, 290] })

In [5]:
authors_price = book.merge(authors, how='inner', on='author_id')

In [6]:
authors_price

   author_id            book_title  price author_name
0          1           Отцы и дети    450    Тургенев
1          1                 Рудин    300    Тургенев
2          1     Дворянское гнездо    350    Тургенев
3          2      Толстый и тонкий    500       Чехов
4          2       Дама с собачкой    450       Чехов
5          3                 Гроза    370  Островский
6          3  Таланты и поклонники    290  Островский

In [7]:
top5 = authors_price.sort_values(by = 'price', ascending= False).head()
top5

   author_id         book_title  price author_name
3          2   Толстый и тонкий    500       Чехов
0          1        Отцы и дети    450    Тургенев
4          2    Дама с собачкой    450       Чехов
5          3              Гроза    370  Островский
2          1  Дворянское гнездо    350    Тургенев

In [8]:
df1 = authors_price.groupby('author_name').agg({'price': 'max'}).rename(columns = {'price': 'max_price'})
df1

             max_price
author_name
Островский         370
Тургенев           450
Чехов              500

In [9]:
df2 = authors_price.groupby('author_name').agg({'price': 'min'}).rename(columns = {'price': 'min_price'})
df2.head()

             min_price
author_name
Островский         290
Тургенев           300
Чехов              450

In [10]:
df3 = authors_price.groupby('author_name').agg({'price':  'mean'}).rename(columns = {'price': 'mean_price'})
df3

             mean_price
author_name
Островский   330.000000
Тургенев     366.666667
Чехов        475.000000

In [11]:
authors_stat = pd.concat([df1, df2, df3], axis = 1)
authors_stat

             max_price  min_price  mean_price
author_name
Островский         370        290  330.000000
Тургенев           450        300  366.666667
Чехов              500        450  475.000000

In [15]:
df_cover= pd.DataFrame({'cover': ['твердая', 'мягкая', 'мягкая','твердая', 'твердая', 'мягкая', 'мягкая']})

In [16]:
df_cover.columns=['cover']

In [18]:
df_cover

     cover
0  твердая
1   мягкая
2   мягкая
3  твердая
4  твердая
5   мягкая
6   мягкая

In [19]:
authors_price = pd.concat([authors_price, df_cover], axis = 1)

authors_price

   author_id            book_title  price author_name    cover
0          1           Отцы и дети    450    Тургенев  твердая
1          1                 Рудин    300    Тургенев   мягкая
2          1     Дворянское гнездо    350    Тургенев   мягкая
3          2      Толстый и тонкий    500       Чехов  твердая
4          2       Дама с собачкой    450       Чехов  твердая
5          3                 Гроза    370  Островский   мягкая
6          3  Таланты и поклонники    290  Островский   мягкая

In [20]:
?pd.pivot_table

In [23]:
book_info = pd.pivot_table(authors_price, values='price', index=['author_name'], columns=['cover'], aggfunc=np.sum,
                           fill_value=0)

book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950